{
  "_name_or_path": "/home/ubuntu/zuum/venv3-9/src/distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Query_for_Shipment_Location",
    "1": "Query_for_Shipment_StartEnd_Date",
    "2": "Query_for_Shipments_sent_in_windowed_time_period",
    "3": "Query_for_Shipment_Status",
    "4": "Query_for_Shipment_ETA",
    "5": "Query_for_Fuel_Price"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Query_for_Fuel_Price": 5,
    "Query_for_Shipment_ETA": 4,
    "Query_for_Shipment_Location": 0,
    "Query_for_Shipment_StartEnd_Date": 1,
    "Query_for_Shipment_Status": 3,
    "Query_for_Shipments_sent_in_windowed_time_period": 2
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "vocab_size": 30522
}
